/**
 * It's are magic!
 */
const log = (...args) => console.log(...args);

/**
 * Числа
 * Запускаем qoukka и наслаждаемся.
 * Самые часто используемые операции:
 * - *
 * - +
 * - -
 * - /
 * - %
 * - < > <= >=
 */
log('сумма:', 2 + 2);
log('разность:', 2 - 2);
/**
 * тэк давай дальше сам
 */
log('умножение:', 0);
log('деление:', 0);
log('остаток от деления:', 0);
/**
 * дальше попробуй поиспользовать болье меньше
 */
log('4-е больше 2-х:', 4 > 2);
/**
 * теперь пройдемся по 
 * https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Math
 *  
 * Давай попробуем найти модель числа
 */
log('Модуль 2 =', Math.abs(2));
/**
 * для всех заданий используем Math
 * @ЗАДАНИЕ
 * найти модуль -24
 * возвести 7 в степень 5
 * найти минимальное число из 2 и 3
 * найти максимальное число из 34, 23, 412, 23
 * вывести случайное число
 */
